# M. Делаем срезы
def task_m():
    input_str = input()
    print(input_str[2])      # Сначала выведите третий символ этой строки.
    print(input_str[-2])     # Во второй строке выведите предпоследний символ этой строки.
    print(input_str[:5])     # В третьей строке выведите первые пять символов этой строки.
    print(input_str[:-2:])   # В четвертой строке выведите всю строку, кроме последних двух символов.
    print(input_str[::2])    # В пятой строке выведите все символы с четными индексами (считая, что индексация начинается с 0, поэтому символы выводятся начиная с первого).
    print(input_str[1::2])   # В шестой строке выведите все символы с нечетными индексами, то есть начиная со второго символа строки.
    print(input_str[::-1])   # В седьмой строке выведите все символы в обратном порядке.
    print(input_str[::-2])   # В восьмой строке выведите все символы строки через один в обратном порядке, начиная с последнего.
    print(len(input_str))    # В девятой строке выведите длину данной строки.


task_m()
